#### Sakila Star Schema & ETL
- Connecting to the postgres sakila database
- Using python packages
    - psycopg2-binary
    - ipython-sql
    - pandas
- Using ipython-sql 
    - load ipython-sql with %load_ext sql
    - To execute sql queries
        - %sql:
            - For one-liner SQL query
            - You can access a python var using $
        - %%sql
            - For multi-line SQL query
            - You can NOT access a python var using $

In [1]:
%load_ext sql

In [2]:
DB_ENDPOINT = '127.0.0.1'
DB = 'sakila'
DB_USER = 'postgres'
DB_PASSWORD = '1234'
DB_PORT = '5432'

conn_string = 'postgresql://{}:{}@{}:{}/{}'\
                .format(DB_USER, DB_PASSWORD, DB_ENDPOINT, DB_PORT, DB)
print(conn_string)

postgresql://postgres:1234@127.0.0.1:5432/sakila

In [3]:
%sql $conn_string

In [4]:
# HOW MUCH, WHAT SIZE DATA SIZES ARE WE LOOKING AT?
nStores = %sql select count(*) from store;
nFilms = %sql select count(*) from film;
nCustomers = %sql select count(*) from customer;
nRentals= %sql select count(*) from rental;
nPayment = %sql select count(*) from payment;
nStaff = %sql select count(*) from staff;
nCity = %sql select count(*) from city;
nCountry = %sql select count(*) from country;

print('nFilms\t\t=', nFilms[0][0])
print('nCustomers\t\t=', nCustomers[0][0])
print('nRentals\t\t=', nRentals[0][0])
print('nPayment\t\t=', nPayment[0][0])
print('nStaff\t\t=', nStaff[0][0])
print('nStores\t\t=', nStores[0][0])
print('nCities\t\t=', nCity[0][0])
print('nCountry\t\t=', nCountry[0][0])

 * postgresql://postgres:***@127.0.0.1:5432/sakila
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/sakila
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/sakila
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/sakila
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/sakila
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/sakila
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/sakila
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/sakila
1 rows affected.
nFilms		= 1000
nCustomers		= 599
nRentals		= 16044
nPayment		= 16049
nStaff		= 2
nStores		= 2
nCities		= 600
nCountry		= 109

In [5]:
%%sql
select min(rental_date) as start, max(rental_date) as end from rental;

 * postgresql://postgres:***@127.0.0.1:5432/sakila
1 rows affected.

[(datetime.datetime(2005, 5, 24, 22, 53, 30), datetime.datetime(2006, 2, 14, 15, 16, 3))]

In [62]:
%%sql
SELECT *
FROM address
LIMIT 10

 * postgresql://postgres:***@127.0.0.1:5432/sakila
10 rows affected.

[(1, '47 MySakila Drive', None, ' ', 300, None, ' ', datetime.datetime(2006, 2, 15, 4, 45, 30)),
 (2, '28 MySQL Boulevard', None, ' ', 576, None, ' ', datetime.datetime(2006, 2, 15, 4, 45, 30)),
 (3, '23 Workhaven Lane', None, ' ', 300, None, ' ', datetime.datetime(2006, 2, 15, 4, 45, 30)),
 (4, '1411 Lillydale Drive', None, ' ', 576, None, ' ', datetime.datetime(2006, 2, 15, 4, 45, 30)),
 (5, '1913 Hanoi Way', None, ' ', 463, '35200', ' ', datetime.datetime(2006, 2, 15, 4, 45, 30)),
 (6, '1121 Loja Avenue', None, ' ', 449, '17886', ' ', datetime.datetime(2006, 2, 15, 4, 45, 30)),
 (7, '692 Joliet Street', None, ' ', 38, '83579', ' ', datetime.datetime(2006, 2, 15, 4, 45, 30)),
 (8, '1566 Inegl Manor', None, ' ', 349, '53561', ' ', datetime.datetime(2006, 2, 15, 4, 45, 30)),
 (9, '53 Idfu Parkway', None, ' ', 361, '42399', ' ', datetime.datetime(2006, 2, 15, 4, 45, 30)),
 (10, '1795 Santiago de Compostela Way', None, ' ', 295, '18743', ' ', datetime.datetime(2006, 2, 15, 4, 45, 30))]

### Perform some simple data analysis
3.1 Insight: Top Grossing Movies

In [6]:
%%sql
SELECT film_id, title, release_year, rental_rate, rating FROM film LIMIT 5;

 * postgresql://postgres:***@127.0.0.1:5432/sakila
5 rows affected.

[(1, 'ACADEMY DINOSAUR', 2006, Decimal('0.99'), 'PG'),
 (2, 'ACE GOLDFINGER', 2006, Decimal('4.99'), 'G'),
 (3, 'ADAPTATION HOLES', 2006, Decimal('2.99'), 'NC-17'),
 (4, 'AFFAIR PREJUDICE', 2006, Decimal('2.99'), 'G'),
 (5, 'AFRICAN EGG', 2006, Decimal('2.99'), 'G')]

In [7]:
%%sql
SELECT * FROM payment LIMIT 5

 * postgresql://postgres:***@127.0.0.1:5432/sakila
5 rows affected.

[(1, 1, 1, 76, Decimal('2.99'), datetime.datetime(2005, 5, 25, 11, 30, 37)),
 (2, 1, 1, 573, Decimal('0.99'), datetime.datetime(2005, 5, 28, 10, 35, 23)),
 (3, 1, 1, 1185, Decimal('5.99'), datetime.datetime(2005, 6, 15, 0, 54, 12)),
 (4, 1, 2, 1422, Decimal('0.99'), datetime.datetime(2005, 6, 15, 18, 2, 53)),
 (5, 1, 2, 1476, Decimal('9.99'), datetime.datetime(2005, 6, 15, 21, 8, 46))]

In [8]:
%%sql 
SELECT * FROM inventory LIMIT 5

 * postgresql://postgres:***@127.0.0.1:5432/sakila
5 rows affected.

[(1, 1, 1, datetime.datetime(2006, 2, 15, 5, 9, 17)),
 (2, 1, 1, datetime.datetime(2006, 2, 15, 5, 9, 17)),
 (3, 1, 1, datetime.datetime(2006, 2, 15, 5, 9, 17)),
 (4, 1, 1, datetime.datetime(2006, 2, 15, 5, 9, 17)),
 (5, 1, 2, datetime.datetime(2006, 2, 15, 5, 9, 17))]

In [9]:
%%sql
SELECT f.title, p.amount, p.payment_date, p.customer_id
FROM payment p
JOIN rental r ON (p.rental_id = r.rental_id)
JOIN inventory i ON (r.inventory_id = i.inventory_id)
JOIN film f ON (i.film_id = f.film_id)
LIMIT 5

 * postgresql://postgres:***@127.0.0.1:5432/sakila
5 rows affected.

[('PATIENT SISTER', Decimal('2.99'), datetime.datetime(2005, 5, 25, 11, 30, 37), 1),
 ('TALENTED HOMICIDE', Decimal('0.99'), datetime.datetime(2005, 5, 28, 10, 35, 23), 1),
 ('MUSKETEERS WAIT', Decimal('5.99'), datetime.datetime(2005, 6, 15, 0, 54, 12), 1),
 ('DETECTIVE VISION', Decimal('0.99'), datetime.datetime(2005, 6, 15, 18, 2, 53), 1),
 ('FERRIS MOTHER', Decimal('9.99'), datetime.datetime(2005, 6, 15, 21, 8, 46), 1)]

In [10]:
%%sql
SELECT f.title, sum(p.amount) as revenue
FROM payment p
JOIN rental r ON (p.rental_id = r.rental_id)
JOIN inventory i ON (r.inventory_id = i.inventory_id)
JOIN film f ON (i.film_id = f.film_id)
GROUP BY title
ORDER BY revenue DESC
LIMIT 5

 * postgresql://postgres:***@127.0.0.1:5432/sakila
5 rows affected.

[('TELEGRAPH VOYAGE', Decimal('231.73')),
 ('WIFE TURN', Decimal('223.69')),
 ('ZORRO ARK', Decimal('214.69')),
 ('GOODFELLAS SALUTE', Decimal('209.69')),
 ('SATURDAY LAMBS', Decimal('204.72'))]

In [11]:
%%sql 
SELECT p.customer_id, p.rental_id, p.amount, ci.city
FROM payment p
JOIN customer c ON (p.customer_id = c.customer_id)
JOIN address a ON (c.address_id = a.address_id)
JOIN city ci ON (a.city_id = ci.city_id)
ORDER BY p.payment_date
LIMIT 5

 * postgresql://postgres:***@127.0.0.1:5432/sakila
5 rows affected.

[(130, 1, Decimal('2.99'), 'guas Lindas de Gois'),
 (459, 2, Decimal('2.99'), 'Qomsheh'),
 (408, 3, Decimal('3.99'), 'Jaffna'),
 (333, 4, Decimal('4.99'), 'Baku'),
 (222, 5, Decimal('6.99'), 'Jaroslavl')]

In [12]:
%%sql 
SELECT ci.city, sum(p.amount) as revenue
FROM payment p
JOIN customer c ON (p.customer_id = c.customer_id)
JOIN address a ON (c.address_id = a.address_id)
JOIN city ci ON (a.city_id = ci.city_id)
GROUP BY ci.city
ORDER BY revenue DESC
LIMIT 5

 * postgresql://postgres:***@127.0.0.1:5432/sakila
5 rows affected.

[('Cape Coral', Decimal('221.55')),
 ('Saint-Denis', Decimal('216.54')),
 ('Aurora', Decimal('198.50')),
 ('Molodetno', Decimal('195.58')),
 ('Apeldoorn', Decimal('194.61'))]

In [13]:
%%sql 
SELECT sum(p.amount) as revenue, EXTRACT(month FROM p.payment_date) as month
FROM payment p
GROUP BY month
ORDER BY revenue DESC
LIMIT 5

 * postgresql://postgres:***@127.0.0.1:5432/sakila
5 rows affected.

[(Decimal('28373.89'), 7.0),
 (Decimal('24072.13'), 8.0),
 (Decimal('9631.88'), 6.0),
 (Decimal('4824.43'), 5.0),
 (Decimal('514.18'), 2.0)]

In [14]:
%%sql 
SELECT f.title, p.amount, p.customer_id, ci.city, p.payment_date, EXTRACT(month FROM p.payment_date) as month
FROM payment p
JOIN rental r ON (p.rental_id = r.rental_id)
JOIN inventory i ON (i.inventory_id = r.inventory_id)
JOIN film f ON (i.film_id = f.film_id)
JOIN customer c ON (p.customer_id = c.customer_id)
JOIN address a ON (a.address_id = c.address_id)
JOIN city ci ON (a.city_id = ci.city_id)
ORDER BY p.payment_date
LIMIT 5

 * postgresql://postgres:***@127.0.0.1:5432/sakila
5 rows affected.

[('BLANKET BEVERLY', Decimal('2.99'), 130, 'guas Lindas de Gois', datetime.datetime(2005, 5, 24, 22, 53, 30), 5.0),
 ('FREAKY POCUS', Decimal('2.99'), 459, 'Qomsheh', datetime.datetime(2005, 5, 24, 22, 54, 33), 5.0),
 ('GRADUATE LORD', Decimal('3.99'), 408, 'Jaffna', datetime.datetime(2005, 5, 24, 23, 3, 39), 5.0),
 ('LOVE SUICIDES', Decimal('4.99'), 333, 'Baku', datetime.datetime(2005, 5, 24, 23, 4, 41), 5.0),
 ('IDOLS SNATCHERS', Decimal('6.99'), 222, 'Jaroslavl', datetime.datetime(2005, 5, 24, 23, 5, 21), 5.0)]

In [15]:
%%sql 
SELECT f.title, ci.city, EXTRACT(month FROM p.payment_date) as month, sum(p.amount) as revenue
FROM payment p
JOIN rental r ON (p.rental_id = r.rental_id)
JOIN inventory i ON (i.inventory_id = r.inventory_id)
JOIN film f ON (i.film_id = f.film_id)
JOIN customer c ON (p.customer_id = c.customer_id)
JOIN address a ON (a.address_id = c.address_id)
JOIN city ci ON (a.city_id = ci.city_id)
GROUP BY (f.title, ci.city, month)
ORDER BY month, revenue DESC
LIMIT 5

 * postgresql://postgres:***@127.0.0.1:5432/sakila
5 rows affected.

[('BOOGIE AMELIE', 'Jaipur', 2.0, Decimal('9.98')),
 ('LUST LOCK', 'Changhwa', 2.0, Decimal('8.97')),
 ('HYDE DOCTOR', 'Bern', 2.0, Decimal('7.98')),
 ('LUST LOCK', 'Lengshuijiang', 2.0, Decimal('7.98')),
 ('PEACH INNOCENT', 'Nagareyama', 2.0, Decimal('7.98'))]